Tekla Open API Reference for Tekla Structures 2025
ApplicationWindowBase.InitializeDataStorage Method
 Initializes the datastorage and registers property bindings for defined viewmodel.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void InitializeDataStorage(
	Object ViewModel
)
Public Sub InitializeDataStorage (
	ViewModel As Object
)
Parameters
ViewModel
Type: System.Object
The view model with StructuresDialog attribute definitions.
See Also
Reference
ApplicationWindowBase Class
Tekla.Structures.Dialog Namespace